gcs92/fire_f11/Drivers/FM33LE0xx_FL_Driver/Inc/fm33le0xx_fl_u7816.h
/**
  * @brief    Get U7816 Receive Parity Error Flag
  * @rmtoll   ISR    RPARERR    FL_U7816_IsActiveFlag_RXParityError
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_U7816_IsActiveFlag_RXParityError(U7816_Type *U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_RPARERR_Msk) == (U7816_ISR_RPARERR_Msk));
}

/**
  * @brief    Clear U7816 Receive Parity Error Flag
  * @rmtoll   ISR    RPARERR    FL_U7816_ClearFlag_RXParityError
  * @param    U7816x U7816 instance
  * @retval   None
  */
__STATIC_INLINE void FL_U7816_ClearFlag_RXParityError(U7816_Type *U7816x)
{
    WRITE_REG(U7816x->ISR, U7816_ISR_RPARERR_Msk);
}

/**
  * @brief    Get U7816 Receive Frame Error Flag
  * @rmtoll   ISR    FRERR    FL_U7816_IsActiveFlag_RXFrameError
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_U7816_IsActiveFlag_RXFrameError(U7816_Type *U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_FRERR_Msk) == (U7816_ISR_FRERR_Msk));
}

/**
  * @brief    Clear U7816 Receive Frame Error Flag
  * @rmtoll   ISR    FRERR    FL_U7816_ClearFlag_RXFrameError
  * @param    U7816x U7816 instance
  * @retval   None
  */
__STATIC_INLINE void FL_U7816_ClearFlag_RXFrameError(U7816_Type *U7816x)
{
    WRITE_REG(U7816x->ISR, U7816_ISR_FRERR_Msk);
}

/**
  * @brief    Get U7816 Receive Overflow Error Flag
  * @rmtoll   ISR    OVERR    FL_U7816_IsActiveFlag_RXOverflow
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_U7816_IsActiveFlag_RXOverflow(U7816_Type *U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_OVERR_Msk) == (U7816_ISR_OVERR_Msk));
}

/**
  * @brief    Clear U7816 Receive Overflow Error Flag
  * @rmtoll   ISR    OVERR    FL_U7816_ClearFlag_RXOverflow
  * @param    U7816x U7816 instance
  * @retval   None
  */
__STATIC_INLINE void FL_U7816_ClearFlag_RXOverflow(U7816_Type *U7816x)
{
    WRITE_REG(U7816x->ISR, U7816_ISR_OVERR_Msk);
}

/**
  * @brief    Get U7816 Receive Complete Flag
  * @rmtoll   ISR    RXIF    FL_U7816_IsActiveFlag_RXComplete
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_U7816_IsActiveFlag_RXComplete(U7816_Type *U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_RXIF_Msk) == (U7816_ISR_RXIF_Msk));
}

/**
  * @brief    Get U7816 Transmit Buffer Empty Flag
  * @rmtoll   ISR    TXIF    FL_U7816_IsActiveFlag_TXBuffEmpty
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_U7816_IsActiveFlag_TXBuffEmpty(U7816_Type *U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_TXIF_Msk) == (U7816_ISR_TXIF_Msk));
}

/**
  * @brief    Get U7816 Error Flag
  * @rmtoll   ISR    ERRIF    FL_U7816_IsActiveFlag_Error
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_U7816_IsActiveFlag_Error(U7816_Type *U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_ERRIF_Msk) == (U7816_ISR_ERRIF_Msk));
}

/**
  * @}
  */

/** @defgroup U7816_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_U7816_DeInit(U7816_Type *U7816x);
FL_ErrorStatus FL_U7816_Init(U7816_Type *U7816x, FL_U7816_InitTypeDef *U7816_InitStruct);
void FL_U7816_StructInit(FL_U7816_InitTypeDef *U7816_InitStruct);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LE0XX_FL_U7816_H*/

/*************************Py_Code_Generator Version: 0.1-0.11-0.2 @ 2020-09-27*************************/
/********************** (C) COPYRIGHT Fudan Microelectronics **** END OF FILE ***********************/
